In [3]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('tips')

In [10]:
df.info

<bound method DataFrame.info of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [13]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [15]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [17]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [19]:
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [33]:
type(df['tip'])

pandas.core.series.Series

In [35]:
df['tip'].value_counts()

tip
2.00    33
3.00    23
4.00    12
5.00    10
2.50    10
        ..
4.34     1
1.56     1
5.20     1
2.60     1
1.75     1
Name: count, Length: 123, dtype: int64

In [37]:
df.ndim

2

In [41]:
df.shape

(244, 7)

In [43]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [45]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [47]:
df.values

array([[16.99, 1.01, 'Female', ..., 'Sun', 'Dinner', 2],
       [10.34, 1.66, 'Male', ..., 'Sun', 'Dinner', 3],
       [21.01, 3.5, 'Male', ..., 'Sun', 'Dinner', 3],
       ...,
       [22.67, 2.0, 'Male', ..., 'Sat', 'Dinner', 2],
       [17.82, 1.75, 'Male', ..., 'Sat', 'Dinner', 2],
       [18.78, 3.0, 'Female', ..., 'Thur', 'Dinner', 2]], dtype=object)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [55]:
df['tip'].astype('int32')

0      1
1      1
2      3
3      3
4      3
      ..
239    5
240    2
241    2
242    1
243    3
Name: tip, Length: 244, dtype: int32

In [57]:
df['tip'].astype('float32')

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float32

In [59]:
df['tip'].astype('category')

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: category
Categories (123, float64): [1.00, 1.01, 1.10, 1.17, ..., 6.73, 7.58, 9.00, 10.00]

In [61]:
df.sort_index(ascending=False).head()

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3

In [71]:
df.sort_values('tip').head()

     total_bill   tip     sex smoker  day    time  size
67         3.07  1.00  Female    Yes  Sat  Dinner     1
236       12.60  1.00    Male    Yes  Sat  Dinner     2
92         5.75  1.00  Female    Yes  Fri  Dinner     2
111        7.25  1.00  Female     No  Sat  Dinner     1
0         16.99  1.01  Female     No  Sun  Dinner     2

In [73]:
df.sort_values('tip',ascending=False).head()

     total_bill    tip   sex smoker   day    time  size
170       50.81  10.00  Male    Yes   Sat  Dinner     3
212       48.33   9.00  Male     No   Sat  Dinner     4
23        39.42   7.58  Male     No   Sat  Dinner     4
59        48.27   6.73  Male     No   Sat  Dinner     4
141       34.30   6.70  Male     No  Thur   Lunch     6

In [77]:
df.sort_values(['tip','size']).head()

     total_bill   tip     sex smoker  day    time  size
67         3.07  1.00  Female    Yes  Sat  Dinner     1
111        7.25  1.00  Female     No  Sat  Dinner     1
92         5.75  1.00  Female    Yes  Fri  Dinner     2
236       12.60  1.00    Male    Yes  Sat  Dinner     2
0         16.99  1.01  Female     No  Sun  Dinner     2

In [79]:
df.sort_values(['tip','size'],ascending=False).head()

     total_bill    tip   sex smoker   day    time  size
170       50.81  10.00  Male    Yes   Sat  Dinner     3
212       48.33   9.00  Male     No   Sat  Dinner     4
23        39.42   7.58  Male     No   Sat  Dinner     4
59        48.27   6.73  Male     No   Sat  Dinner     4
141       34.30   6.70  Male     No  Thur   Lunch     6

In [81]:
df.loc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [83]:
df.loc[3,'tip']

3.31

In [89]:
df.loc[2:5,['tip','size']]

    tip  size
2  3.50     3
3  3.31     2
4  3.61     4
5  4.71     4

In [91]:
df.loc[:,['tip','size']]

      tip  size
0    1.01     2
1    1.66     3
2    3.50     3
3    3.31     2
4    3.61     4
..    ...   ...
239  5.92     3
240  2.00     2
241  2.00     2
242  1.75     2
243  3.00     2

[244 rows x 2 columns]

In [97]:
df[['tip','size']]

      tip  size
0    1.01     2
1    1.66     3
2    3.50     3
3    3.31     2
4    3.61     4
..    ...   ...
239  5.92     3
240  2.00     2
241  2.00     2
242  1.75     2
243  3.00     2

[244 rows x 2 columns]

In [101]:
cond = df['sex'] == 'Male'
cond

0      False
1       True
2       True
3       True
4      False
       ...
239     True
240    False
241     True
242     True
243    False
Name: sex, Length: 244, dtype: bool

In [103]:
df[cond].head()

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

In [105]:
df.loc[cond].head()

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

In [107]:
df[cond]['size'] = 4

C:\Users\이아랑\AppData\Local\Temp\ipykernel_2712\2414807129.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[cond]['size'] = 4

In [109]:
df.loc[cond,'size'] = 4

In [111]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     4
2       21.01  3.50    Male     No  Sun  Dinner     4
3       23.68  3.31    Male     No  Sun  Dinner     4
4       24.59  3.61  Female     No  Sun  Dinner     4

In [135]:
cond1 = df['tip'] == 1.66
cond2 = df['size'] == 2

In [137]:
df.loc[cond1 & cond2].head

<bound method NDFrame.head of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.66  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     2
2         21.01  1.66    Male     No   Sun  Dinner     2
3         23.68  1.66    Male     No   Sun  Dinner     2
4         24.59  1.66  Female     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  1.66    Male     No   Sat  Dinner     2
240       27.18  1.66  Female    Yes   Sat  Dinner     2
241       22.67  1.66    Male    Yes   Sat  Dinner     2
242       17.82  1.66    Male     No   Sat  Dinner     2
243       18.78  1.66  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [139]:
df.loc[cond1 | cond2].head

<bound method NDFrame.head of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.66  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     2
2         21.01  1.66    Male     No   Sun  Dinner     2
3         23.68  1.66    Male     No   Sun  Dinner     2
4         24.59  1.66  Female     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  1.66    Male     No   Sat  Dinner     2
240       27.18  1.66  Female    Yes   Sat  Dinner     2
241       22.67  1.66    Male    Yes   Sat  Dinner     2
242       17.82  1.66    Male     No   Sat  Dinner     2
243       18.78  1.66  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [143]:
df.iloc[1,3]

'No'

In [145]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.66  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     2
2       21.01  1.66    Male     No  Sun  Dinner     2
3       23.68  1.66    Male     No  Sun  Dinner     2
4       24.59  1.66  Female     No  Sun  Dinner     2

In [147]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  1.66    Male     No   Sat  Dinner     2
240       27.18  1.66  Female    Yes   Sat  Dinner     2
241       22.67  1.66    Male    Yes   Sat  Dinner     2
242       17.82  1.66    Male     No   Sat  Dinner     2
243       18.78  1.66  Female     No  Thur  Dinner     2

In [161]:
df['tip'].where(df['tip'] < 30 )
df['tip'].where(cond1,1).tail

<bound method NDFrame.tail of 0      1.66
1      1.66
2      1.66
3      1.66
4      1.66
       ...
239    1.66
240    1.66
241    1.66
242    1.66
243    1.66
Name: tip, Length: 244, dtype: float64>

In [179]:
cond = df['day'].isin(['Sat','Thur'])
df.loc[cond].head()

   total_bill   tip     sex smoker   day    time  size
0       16.99  1.66  Female     No  Thur  Dinner     2
1       10.34  1.66    Male     No  Thur  Dinner     2
2       21.01  1.66    Male     No  Thur  Dinner     2
3       23.68  1.66    Male     No  Thur  Dinner     2
4       24.59  1.66  Female     No  Thur  Dinner     2

In [183]:
cond1 = df['day'] == 'Sat'
cond2 = df['day'] == 'Thur'
df.loc[cond1 | cond2].head()

   total_bill   tip     sex smoker   day    time  size
0       16.99  1.66  Female     No  Thur  Dinner     2
1       10.34  1.66    Male     No  Thur  Dinner     2
2       21.01  1.66    Male     No  Thur  Dinner     2
3       23.68  1.66    Male     No  Thur  Dinner     2
4       24.59  1.66  Female     No  Thur  Dinner     2

In [193]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [195]:
import numpy as np
import pandas as pd
import seaborn as sns

In [197]:
df =sns.load_dataset('titanic')

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [205]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [209]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [211]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [213]:
df['age'].count()

714

In [229]:
arr = np.arange(15).reshape(3,5)
temp_df = pd.DataFrame(arr)
temp_df.mean()

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [231]:
df.mean(numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [233]:
df['age'].mean()

29.69911764705882

In [235]:
df.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [239]:
cond = df['adult_male'] == True
df.loc[cond,'age'].mean()

29.69911764705882

In [246]:
c1 = df['fare'] >=30
c2 = df['fare'] <40

c3 = df['pclass'] == 1

df.loc[c1 & c2 & c3,'age'].mean()

44.095238095238095

In [252]:
df.mean(numeric_only = True, skipna = False)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     1.000000
alone          0.602694
dtype: float64

In [258]:
pd.Series([1,2,4,5,99999]).median()

4.0

In [260]:
pd.Series([1,2,4,5,99999]).mean()

20002.2

In [262]:
pd.Series([1,2,4,5,7,99999]).median()

4.5

In [264]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      891.0000
alone           537.0000
dtype: float64

In [266]:
df['fare'].sum()

28693.9493

In [270]:
df['fare'].cumsum()

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [274]:
df['age'].cumprod()

C:\Anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:59: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

In [286]:
fare_mean = df['fare'].values.mean()

total = ((df['fare'].values - fare_mean ) ** 2).sum()
total_count = df['fare'].count() - 1
my_var = total/total_count
my_var

2469.436845743116

In [288]:
df['fare'].var()

2469.436845743117

In [290]:
np.sqrt(df['fare'].var())

49.693428597180905

In [294]:
df['fare'].std()

49.693428597180905

In [300]:
df['age'].max()

80.0

In [304]:
df['age'].min()

0.42

In [306]:
df['age'].agg(['mean','std'])

mean    29.699118
std     14.526497
Name: age, dtype: float64

In [312]:
df[['age','fare']].agg(['mean','count','min','max'])

              age        fare
mean    29.699118   32.204208
count  714.000000  891.000000
min      0.420000    0.000000
max     80.000000  512.329200

In [316]:
df['age'].quantile(0.1)

14.0

In [318]:
df['age'].quantile(0.5)

28.0

In [320]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [324]:
df['who'].nunique()

3

In [326]:
df['who'].mode()[0]

'man'

In [330]:
df['who'].mode()

0    man
Name: who, dtype: object

In [332]:
df.corr(numeric_only= True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,NaN,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,NaN,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,NaN,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,NaN,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,NaN,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,NaN,-0.271832
adult_male,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,NaN,1.000000

In [340]:
df.corr(numeric_only=True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male         NaN
alone        -0.203367
Name: survived, dtype: float64

In [344]:
import pandas as pd
import numpy as npd
import seaborn as sns

df = sns.load_dataset('titanic')

In [346]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [354]:
df_copy = df.copy()

In [356]:
df_copy.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [358]:
id(df)

2736927272272

In [362]:
id(df_copy)

2736928400528

In [366]:
df_copy.loc[0,'age'] = 999

In [368]:
df_copy.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,999.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [370]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [392]:
df.notnull().sum().sum()

12496

In [402]:
cond = df['age'].isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True

In [410]:
c1 = df['age'].isnull()
df.loc[c1, 'age'] = 30

In [412]:
df.loc[5]

survived                0
pclass                  3
sex                  male
age                  30.0
sibsp                   0
parch                   0
fare               8.4583
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 5, dtype: object

In [416]:
df = sns.load_dataset('titanic')

In [418]:
df1 = df.copy()

In [420]:
df['age'].fillna(100).tail()

886     27.0
887     19.0
888    100.0
889     26.0
890     32.0
Name: age, dtype: float64

In [424]:
df1['age'] = df1['age'].fillna(100)

In [426]:
df1.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,100.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [428]:
df1['deck'].fillna('C')

#인덱스 ,

0      C
1      C
2      C
3      C
4      C
      ..
886    C
887    B
888    C
889    C
890    C
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [440]:
df1['deck'] = df1['deck'].cat.add_categories('No Data')
df1['deck'].fillna('No Data')

ValueError: new categories must not include old categories: {'No Data'}

In [443]:
df1 = df.copy()

In [445]:
mean_age = df1['age'].mean()
df1['age'].fillna(mean_age).tail()

886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, dtype: float64

In [449]:
median_age = df1['age'].mean()
df1['age'].fillna(median_age).tail()

886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, dtype: float64

In [453]:
c1 = df1['sex'] == 'male'
male_mean = df1.loc[c1,'age'].mean()
df1.loc[c1,'age'] = df1.loc[c1,'age'].fillna(male_mean)

c2 = df1['sex'] == 'female'
female_mean = df1.loc[c2,'age'].mean()
df1.loc[c2,'age'] = df1.loc[c2,'age'].fillna(female_mean)

In [455]:
df1['age'].mean()

29.736034227171306

In [457]:
df1['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']